In [1]:
import numpy as np
import pandas as pd

In [2]:
#索引对象不可变，保证数据安全，即不能通过ps.index[?]=?改变索引值
ps = pd.Series(range(5))
pd1 = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['A','B','C'])
ps

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [3]:
#重新索引，reindex,创建一个符合新索引的新对象
ps1 = ps.reindex(['a','b','c','d','e','f'])
ps1

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
f   NaN
dtype: float64

In [4]:
ps

0    0
1    1
2    2
3    3
4    4
dtype: int64

**增**

In [5]:
ps[5]=9
ps

0    0
1    1
2    2
3    3
4    4
5    9
dtype: int64

In [6]:
s1 = pd.Series({'f':999})
ps1 = ps.append(s1)
ps1

0      0
1      1
2      2
3      3
4      4
5      9
f    999
dtype: int64

In [7]:
pd1.insert(0,'E',[9,99,999])
pd1

     E  A  B  C
a    9  0  1  2
b   99  3  4  5
c  999  6  7  8

In [10]:
#标签索引loc
pd1.loc['d']=[1,1,1,1]
pd1

     E  A  B  C
a    9  0  1  2
b   99  3  4  5
c  999  6  7  8
d    1  1  1  1

In [11]:
row = {'E':6,'A':6,'B':6,'C':6,4:6}
pd3 = pd1.append(row,ignore_index=True)
pd3

     E  A  B  C    4
0    9  0  1  2  NaN
1   99  3  4  5  NaN
2  999  6  7  8  NaN
3    1  1  1  1  NaN
4    6  6  6  6  6.0

**删**

In [22]:
pd1

     E  A  B  C
a    9  0  1  2
b   99  3  4  5
c  999  6  7  8
d    1  1  1  1

In [21]:
#del可删除列
#drop删除轴上数据,并产生新的对象
ps3 = ps1.drop(['f',1])
ps3

0    0
2    2
3    3
4    4
5    9
dtype: int64

In [24]:
pd1.drop(['a','b'])

     E  A  B  C
c  999  6  7  8
d    1  1  1  1

In [26]:
pd1.drop('A',axis=1)

     E  B  C
a    9  1  2
b   99  4  5
c  999  7  8
d    1  1  1

In [27]:
#inplace属性，原对象上删除，不会返回新对象
ps.drop(4,inplace=True)
ps

0    0
1    1
2    2
3    3
5    9
dtype: int64